/*----------------------Інформація про ЗВО----------------------*/

/*Загальна відомість про заклад вищої освіти*/
INSERT INTO higher_educational_institution (id, hei_id,
                                            higher_educational_institution_name, institution_code, website,
                                            head_full_name_id)
VALUES ('ca07c977-4325-486e-add8-e0c46df40ddf', 174,
        'Національний технічний університет України «Київський політехнічний інститут імені Ігоря Сікорського»', 02070921, 'http://kpi.ua',
        'fe017aa6-9d3d-4ecc-865f-9d097cb7577a');

/*Інформація про відокремлений структурний підрозділ (ВСП)*/
INSERT INTO separate_structural_unit (id, ssu_id, separate_structural_unit_name,
                                      ssu_code, website, head_full_name_id)
VALUES ('8e59b321-a3a0-4be6-9fd1-cfca054c3773', 174, 'Національний технічний університет України «Київський політехнічний інститут імені Ігоря Сікорського»',
		02070921, 'http://kpi.ua',
        'fe017aa6-9d3d-4ecc-865f-9d097cb7577a');

/*Інформація про заклад вищої освіти*/
INSERT INTO higher_education_institution_information (id, hei_id)
VALUES ('4a9d6819-8987-4111-93a6-93c3b758a235', 'ca07c977-4325-486e-add8-e0c46df40ddf');

/*Посилання на інформацію про ЗВО (ВСП ЗВО) у Реєстрі суб’єктів освітньої діяльності ЄДЕБО*/

INSERT INTO hei_links_in_edebo (id, website)
VALUES ('d97d731a-c1e0-4a34-b10d-b5467dd6c028', 'https://registry.edbo.gov.ua/university/174/');

/*----------------------Освітня програма----------------------*/

/*Інформація про освітні програми ЗВО за відповідною спеціальністю*/
INSERT INTO education_program (id, education_program_id, name, level)
VALUES ('9f1902c4-f2f0-4c9e-81b2-d10b164860c9', 46344, 'Інженерія програмного забезпечення', 'FIRST'),
	   ('653bca5e-7866-4cd0-bba0-a8d546cf1d57', 4858, 'Програмне забезпечення розподілених систем', 'FIRST');

/*Галузь знань*/
INSERT INTO field_of_study (id, field_of_study_code, field_of_study)
VALUES ('24b29589-5db8-4918-a872-784e5495e6e9', 12, 'Інформаційні технології');

/*Спеціальність*/
INSERT INTO specialty (id, specialty_code, specialty)
VALUES ('4959d5fb-95af-4356-b626-8ebdd1b186f0', 121, 'Інженерія програмного забезпечення');

/*Структурний підрозділ відповідальний за реалізацію ОП*/
INSERT INTO subdivision (id, responsible_department)
VALUES ('b6c68abb-c09b-4d8d-a280-9fc84a7f2b3a', 'Кафедра програмного забезпечення комп’ютерних систем факультету прикладної математики');

/*Загальна інформація про освітню програму, яка подається на акредитацію*/
INSERT INTO education_program_accreditation_information (id, specialty_licensing_info,
														 cycle, program_type, admission_degree, duration,
														 education_program_forms, location,
														 grants_professional_qualification, guarantee_email, guarantee_phone, additional_phone,
														 education_program_id, field_of_study_id,
														 guarantee_id, specialty_id, subdivision_id)
VALUES ('6d6fb063-8675-4f11-8521-e03c0e438bc6', 'Сертифікат про акредитацію освітньої програми - 5436 ,дійсний до 01.07.2027',
		'Доктор філософії', 'Освітньо-наукова', 'Магістр (ОКР «спеціаліст»)', '4 р. 0 м.,4 р. 0 м.,4 р. 0 м.', 'заочна,очна вечірня,очна денна',
		'03056 Київ,
вулиця Політехнічна, 14а, корпус №14;
вулиця Політехнічна, 41, корпус №18;
вулиця Політехнічна, 6, корпус №5;
проспект Перемоги, 37 к , корпус № 7.', false, 'dychka@pzks.fpm.kpi.ua', '+38(044)-204-81-15', '+38(044)-204-91-13',
		'9f1902c4-f2f0-4c9e-81b2-d10b164860c9', '24b29589-5db8-4918-a872-784e5495e6e9',
		'fe017aa6-9d3d-4ecc-865f-9d097cb7577a', '4959d5fb-95af-4356-b626-8ebdd1b186f0',
		'b6c68abb-c09b-4d8d-a280-9fc84a7f2b3a');

/*Загальні відомості про ОП, історію її розроблення та впровадження*/
INSERT INTO education_program_general_information (id, history_and_development)
VALUES ('6e76cb25-8364-4628-b718-db96469ff00b', 'Ліцензію на провадження освітньої діяльності у сфері вищої освіти на третьому освітньо-науковому рівні за освітньою програмою 121 Інженерія програмного забезпечення КПІ ім. Ігоря Сікорського  отримано згідно наказу МОН № 655 від 10.06.2016 р. Підготовка аспірантів здійснюється на кафедрі програмного забезпечення комп’ютерних систем факультету прикладної математики, на всіх кафедрах факультету інформатики та обчислювальної техніки (кафедра автоматики та управління в технічних системах, кафедра обчислювальної техніки, кафедра автоматизованих систем обробки інформації та управління, кафедра технічної кібернетики) та на кафедрі автоматизації проєктування енергетичних процесів і систем теплоенергетичного факультету.
Освітньо-наукова програма «Інженерія програмного забезпечення» (ОНП «ІПЗ») третього (освітньо-наукового) рівня вищої освіти була розроблена проєктною групою під керівництвом д.т.н., проф. Дички І.А., до складу якої були залучені провідні науково-педагогічні працівники трьох факультетів університету (9 д.т.н., проф. та 6 к.т.н., доц.).
До відкриття цієї освітньої програми в аспірантурі КПІ ім. Ігоря Сікорського здійснювалась підготовка кандидатів наук зі спеціальностей 01.05.02 Математичне моделювання та обчислювальні методи, 01.05.03 Математичне та програмне забезпечення обчислювальних машин та систем.
Наукова діяльність здобувачів ступеня доктор філософії ведеться у таких наукових групах:
ФПМ-03 Автоматична ідентифікація об’єктів, д.т.н., проф. Дичка Іван Андрійович
ФПМ-04 Цифрове оброблення мультимодальних даних, д.т.н., доц. Сулема Євгенія Станіславівна
ФІОТ-04 Інформаційні технології і системи управління ІТ-інфраструктурою хмарних ЦОД, д.т.н., доц. Жаріков Едуард В’ячеславович
ФІОТ-05 Системи моніторингу, моделювання та управління, д.т.н., проф. Стеценко Інна Вячеславівна
ФІОТ-06 Комп’ютерна лінгвістика, аналіз та обробка текстів, лінгвістичне моделювання, розпізнавання аномалій в даних, к.т.н., доц. Фіногенов Олексій Дмитрович
ФІОТ-07 Штучній інтелект та розумні пристрої (Машинне навчання, Глибинне навчання, Комп’ютерний зір, Аналіз і розпізнавання зображень, Розробка та програмування вбудованих систем), д.т.н., проф. Стіренко Сергій Григорович
ФІОТ-10 Інформаційні технології та системи управління ІТ-інфраструктурами. Інтелектуальні вбудовані системи та інтернет речей, д.т.н., проф. Ролік Олександр Іванович
ФІОТ-11 Методи і технології високопродуктивних обчислень, д.т.н., проф.  Дорошенко Анатолій Юхимович
ТЕФ-13 Інтелектуальний аналіз великих масивів даних, к.т.н., доц. Коваль Олександр Васильович
ТЕФ-17 Програмне та апаратне забезпечення еколого-економічного моніторингу довкілля, д.т.н., проф. Сліпченко Володимир Георгійович
Мета ОНП «ІПЗ» полягає у підготовці висококваліфікованих, конкурентоспроможних, інтегрованих у європейський та світовий науково-технічний простір фахівців ступеня доктора філософії з інженерії програмного забезпечення, здатних до самостійної науково-дослідної, науково-інноваційної, організаційно-управлінської та педагогічної діяльності у галузі технічних наук за спеціальністю 121 Інженерія програмного забезпечення та суміжних галузях, що реалізується через: гармонійну та багатовимірну підготовку майбутніх висококваліфікованих технічних фахівців, спроможних комплексно й системно аналізувати та вирішувати проблеми інженерії програмного забезпечення і суміжних галузей; формування високої адаптивності здобувачів вищої освіти в умовах трансформації ринку праці через взаємодію з роботодавцями та іншими стейкхолдерами; інтернаціоналізацію освітнього процесу. Мета освітньої̈ програми відповідає стратегії розвитку КПІ ім. Ігоря Сікорського на 2020-2025 роки щодо формування суспільства майбутнього на засадах концепції̈ сталого розвитку.
ОНП «ІПЗ» розміщена на сайті університету https://osvita.kpi.ua/121-ipz
У 2016-2020 роки прийом до аспірантури КПІ ім. Ігоря Сікорського за спеціальністю 121 Інженерія програмного забезпечення здійснювався щорічно.
Успішно закінчили аспірантуру та захистили дисертації PhD за спеціальністю 121 Інженерія програмного забезпечення аспіранти Радченко Євгеній (захист відбувся 26.04.2021 року) та Сулема Ольга (захист відбувся 17.05.2021 року).');

/*Інформація про площі приміщень ЗВО*/
INSERT INTO higher_education_institution_area (id, all_rooms, own_rooms, other_rights_rooms, rented_rooms,
											   educational_all_rooms, educational_own_rooms,
											   educational_other_rights_rooms, educational_rented_rooms)
VALUES ('efc17fb6-a8a2-43a5-8018-77e6c36fc3ac', 545692, 545692, 0, 4825, 168106, 168106, 0, 0);

/*Інформація про наявність в акредитаційній справі інформації з обмеженим доступом*/
INSERT INTO self_assessment_educational_program_restricted_info (id, info_description, info_access_restriction_type,
																 restricted_info_description,
																 restricting_access_grounds)
VALUES ('bf4118a2-fe70-4104-ae69-528a5e9c41df', '', '', '', '');


/*----------------------Загальна відомість----------------------*/
INSERT INTO general_information (id, education_program_accreditation_information_id,
								 education_program_general_information_id, hei_links_in_edebo_id,
								 higher_education_institution_area_id, higher_education_institution_information_id,
								 self_assessment_educational_program_restricted_info_id)
VALUES ('0c1ad6fd-c1d3-4ace-bcef-34251a12dcd8', '6d6fb063-8675-4f11-8521-e03c0e438bc6',
		'6e76cb25-8364-4628-b718-db96469ff00b', 'd97d731a-c1e0-4a34-b10d-b5467dd6c028',
		'efc17fb6-a8a2-43a5-8018-77e6c36fc3ac', '4a9d6819-8987-4111-93a6-93c3b758a235',
		'bf4118a2-fe70-4104-ae69-528a5e9c41df');

/*Інші освітні програми за обраними відомостями*/
INSERT INTO general_information_education_programs (education_programs_id, general_information_id)
VALUES ('653bca5e-7866-4cd0-bba0-a8d546cf1d57', '0c1ad6fd-c1d3-4ace-bcef-34251a12dcd8');

/*Інформація про контингент здобувачів вищої освіти на ОП станом на 1 жовтня поточного навчального року та набір на ОП*/
INSERT INTO education_statistics (id, general_information_id, study_course_year, academic_year, enrollment, full_time,
								  evening, part_time, foreign_full_time, foreign_evening, foreign_part_time)
VALUES ('18fc0570-d87a-4026-aff3-19265ca30dca', '0c1ad6fd-c1d3-4ace-bcef-34251a12dcd8', 0, '2020', 16, 14, 1, 0, 1, 0, 0),
	   ('05f856a3-955d-4aba-8398-75597983edcc', '0c1ad6fd-c1d3-4ace-bcef-34251a12dcd8', 1, '2019', 20, 12, 1, 5, 0, 0, 1),
	   ('2c77153b-4425-4b6b-b68f-20bdb24a82d8', '0c1ad6fd-c1d3-4ace-bcef-34251a12dcd8', 2, '2018', 12, 7, 0, 0, 0, 0, 0),
	   ('37fb74aa-5adb-11ee-8c99-0242ac120002', '0c1ad6fd-c1d3-4ace-bcef-34251a12dcd8', 3, '2017', 4, 5, 0, 2, 0, 0, 0);

/*Поля для завантаження загальних документів*/
INSERT INTO education_program_document (id, type, name, hash)
VALUES ('a79134d5-f54e-4d5c-9299-5d081a5ce10c', 'CURRICULUM','121_NP_IPZ_2020.pdf', '+xTa9I3EF5vxwG/XOb8V35bcVYU9ecxakffnGWiXM+8='),
	   ('e8f95e52-5aea-11ee-8c99-0242ac120002', 'EDUCATION_PROGRAM','121_ONPD_IPZ_2020.pdf', '+xTa9I3EF5vxwG/XOb8V35bcVYU9ecxakffnGWiXM+8='),
	   ('ed47482a-5aea-11ee-8c99-0242ac120002', 'REVIEW','Рецензія PhD НАН.pdf', '+xTa9I3EF5vxwG/XOb8V35bcVYU9ecxakffnGWiXM+8=');

/*Додати документи до загальної інформації*/
INSERT INTO general_information_education_program_documents (general_information_id, education_program_documents_id)
VALUES ('0c1ad6fd-c1d3-4ace-bcef-34251a12dcd8', 'a79134d5-f54e-4d5c-9299-5d081a5ce10c'),
	   ('0c1ad6fd-c1d3-4ace-bcef-34251a12dcd8', 'e8f95e52-5aea-11ee-8c99-0242ac120002'),
	   ('0c1ad6fd-c1d3-4ace-bcef-34251a12dcd8', 'ed47482a-5aea-11ee-8c99-0242ac120002');

/*Мови викладання*/
INSERT INTO language (id, name, short_name)
VALUES ('5e2fe72c-44f2-408f-b4a2-5b8132c86a67', 'Українська', 'укр.'),
	   ('b507088d-5b8d-4a84-b519-532af135ee43', 'Англійська', 'англ.');

/*Додати мови викладання до загальної інформації*/
INSERT INTO education_program_accreditation_information_languages (education_program_accreditation_information_id, languages_id)
VALUES ('6d6fb063-8675-4f11-8521-e03c0e438bc6', '5e2fe72c-44f2-408f-b4a2-5b8132c86a67'),
	   ('6d6fb063-8675-4f11-8521-e03c0e438bc6', 'b507088d-5b8d-4a84-b519-532af135ee43');
